cases/t3a_ko/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters   1;

vertices
(
	(-0.1 0 0)
	(0 0 0)
	(0 0.5 0)
	(-0.1 0.5 0)
	(-0.1 0 0.1)
	(0 0 0.1)
	(0 0.5 0.1)
	(-0.1 0.5 0.1)
	(2 0 0)
	(2 0.5 0)
	(2 0 0.1)
	(2 0.5 0.1)	
    
);

blocks
(
	hex (0 1 2 3 4 5 6 7) (20 350 1) 
	simpleGrading 
	(
	0.1
	(
	(0.1 0.65 10)
	(0.3 0.25 10)
	(0.6 0.1 5)
	)
	1
	)
		
hex (1 8 9 2 5 10 11 6) (200 350 1) 
	simpleGrading 
	(
	10
	(
	(0.1 0.65 10) 
	(0.3 0.25 10) 
	(0.6 0.1 5)
	)
	1
	)

);

edges
(

);

boundary
(
    above
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (2 6 11 9)
        );
    }

    top
    {
        type patch;
        faces
        (
            (0 1 5 4)
            
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (8 10 11 9)           
        );
    }

    plate
    {
        type wall;
        faces
        (
            (8 10 5 1)
        );
    }
);


// ************************************************************************* //
